app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
def index
    render json: Trip.all, status: :ok

INSERT INTO "trips" ("fullname", "start_date", "end_date", "activities", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
def create
    trip = Trip.create!(trip_params)